<h2 id="Contents">Contents<a href="#Contents"></a></h2>
        <ol>
        <ol><li><a class="" href="#Loading-the-Database">Loading the Database</a></li>
<li><a class="" href="#Basics">Basics</a></li>
<ol><li><a class="" href="#SELECTing-single-columns">SELECTing single columns</a></li>
<li><a class="" href="#SELECTing-multiple-columns">SELECTing multiple columns</a></li>
<li><a class="" href="#DISTINCT-Values">DISTINCT Values</a></li>
<li><a class="" href="#Learning-to-COUNT">Learning to COUNT</a></li>
</ol><li><a class="" href="#Filtering">Filtering</a></li>
<ol><li><a class="" href="#Simple-filtering-of-numeric-values">Simple filtering of numeric values</a></li>
<li><a class="" href="#Simple-filtering-of-text">Simple filtering of text</a></li>
<li><a class="" href="#WHERE-AND">WHERE AND</a></li>
<li><a class="" href="#WHERE-AND-OR">WHERE AND OR</a></li>
<li><a class="" href="#BETWEEN">BETWEEN</a></li>
<li><a class="" href="#IN-BETWEEN">IN BETWEEN</a></li>
<li><a class="" href="#Introduction-to-NULL-and-IS-NULL">Introduction to NULL and IS NULL</a></li>
<li><a class="" href="#LIKE-and-NOT-LIKE">LIKE and NOT LIKE</a></li>
</ol><li><a class="" href="#Aggregate-functions-and-Aliasing">Aggregate functions and Aliasing</a></li>
<ol><li><a class="" href="#Combining-aggregate-functions-with-WHERE">Combining aggregate functions with WHERE</a></li>
<li><a class="" href="#AS-aliasing">AS aliasing</a></li>
</ol><li><a class="" href="#ORDER-BY-and-GROUP-BY">ORDER BY and GROUP BY</a></li>
<ol><li><a class="" href="#Sorting-multiple-columns">Sorting multiple columns</a></li>
<li><a class="" href="#GROUP-BY">GROUP BY</a></li>
<li><a class="" href="#HAVING">HAVING</a></li>
</ol>

## Loading the Database

In [1]:
%load_ext sql
%sql mysql://hari31416:****@localhost:8080/movies

Let's see what tables do we have:

In [2]:
%sql SHOW TABLES

 * mysql://hari31416:***@localhost:8080/movies
17 rows affected.

[('country',),
 ('department',),
 ('gender',),
 ('genre',),
 ('keyword',),
 ('language',),
 ('language_role',),
 ('movie',),
 ('movie_cast',),
 ('movie_company',),
 ('movie_crew',),
 ('movie_genres',),
 ('movie_keywords',),
 ('movie_languages',),
 ('person',),
 ('production_company',),
 ('production_country',)]

We have over 15 tables in our database.

How are these tables related to each other? Here is the ERD:

![](img/03_01.png)

For more details related to the database, follow the [link](https://www.databasestar.com/sample-database-movies/).

## Basics

### SELECTing single columns

In `SQL`, you can select data from a table using a `SELECT` statement. For example, the following query selects the name column from the people table:

>SELECT name<br>
FROM people;

In this query, `SELECT` and `FROM` are called keywords. In `SQL`, keywords are not case-sensitive, which means you can write the same query as:

>select name<br>
from people;

That said, it's good practice to make `SQL` keywords uppercase to distinguish them from other parts of your query, like column and table names.

It's also good practice to include a semicolon at the end of your query. This tells `SQL` where the end of your query is!

In [3]:
%%sql
SELECT title
FROM movie
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[('Four Rooms',),
 ('Star Wars',),
 ('Finding Nemo',),
 ('Forrest Gump',),
 ('American Beauty',),
 ('Dancer in the Dark',),
 ('The Fifth Element',),
 ('Metropolis',),
 ('My Life Without Me',),
 ('Pirates of the Caribbean: The Curse of the Black Pearl',)]

We have used the `LIMIT` keyword in our query to limit the number of rows we want to return as there are a lot of rows in our database.

### SELECTing multiple columns

To select multiple columns from a table, simply separate the column names with commas!
<br>For example, this query selects two columns, `name` and `birthdate`, from the `people` table:

>SELECT name, birthdate
FROM people;

Sometimes, you may want to select all columns from a table. Typing out every column name would be a pain, so there's a handy shortcut:

>SELECT *
FROM people;

If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

>SELECT *
FROM people
LIMIT 10;

In [4]:
%%sql
SELECT title, budget
FROM movie
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[('Four Rooms', 4000000),
 ('Star Wars', 11000000),
 ('Finding Nemo', 94000000),
 ('Forrest Gump', 55000000),
 ('American Beauty', 15000000),
 ('Dancer in the Dark', 12800000),
 ('The Fifth Element', 90000000),
 ('Metropolis', 92620000),
 ('My Life Without Me', 0),
 ('Pirates of the Caribbean: The Curse of the Black Pearl', 140000000)]

### DISTINCT Values

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the `DISTINCT` keyword.

In [9]:
%%sql
SELECT DISTINCT movie_status
from movie;

 * mysql://hari31416:***@localhost:8080/movies
3 rows affected.

[('Released',), ('Rumored',), ('Post Production',)]

### Learning to COUNT

The `COUNT()` function lets you do this by returning the number of rows in one or more columns.<br>`COUNT(*)` tells you how many rows are in a table. However, if you want to count the number of non-missing values in a particular column, you can call `COUNT()` on just that column.

For example, to count the number of birth dates present in the people table:

>SELECT COUNT(birthdate)
FROM people;

In [12]:
%%sql
SELECT COUNT(title)
FROM movie;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(4803,)]

It's also common to combine `COUNT()` with `DISTINCT` to count the number of distinct values in a column.
For example, this query counts the number of distinct birth dates contained in the people table:

>SELECT COUNT(DISTINCT birthdate)
FROM people;

In [15]:
%%sql
SELECT COUNT(DISTINCT country_name)
FROM country;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(88,)]

## Filtering

In `SQL`, the `WHERE` keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

* = equal
* <> not equal
* < less than
* {}> greater than
* <= less than or equal to
* {}>= greater than or equal to<br>
**Ignore the {}**
<br>
For example, you can filter text records such as `title`. The following code returns all films with the `title` 'Metropolis':

>SELECT title<br>
FROM films<br>
WHERE title = 'Metropolis';

In [17]:
%%sql
SELECT title
FROM movie
WHERE title = 'Star Wars';

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[('Star Wars',)]

### Simple filtering of numeric values

The following query selects all details for films with a budget over ten thousand dollars:

>SELECT *<br>
FROM films<br>
WHERE budget > 10000;

In [23]:
%%sql
SELECT title
FROM movie
WHERE budget > 200000000;

 * mysql://hari31416:***@localhost:8080/movies
27 rows affected.

[('King Kong',),
 ("Pirates of the Caribbean: At World's End",),
 ('Spider-Man 3',),
 ('Harry Potter and the Half-Blood Prince',),
 ('Superman Returns',),
 ('Pirates of the Caribbean: On Stranger Tides',),
 ('The Amazing Spider-Man',),
 ('The Chronicles of Narnia: Prince Caspian',),
 ('Avatar',),
 ('The Avengers',),
 ('X-Men: The Last Stand',),
 ('Tangled',),
 ('Men in Black 3',),
 ('Battleship',),
 ('The Dark Knight Rises',),
 ('The Hobbit: An Unexpected Journey',),
 ('Man of Steel',),
 ('John Carter',),
 ('The Hobbit: The Desolation of Smaug',),
 ('The Lone Ranger',),
 ('Transformers: Age of Extinction',),
 ('Avengers: Age of Ultron',),
 ('The Hobbit: The Battle of the Five Armies',),
 ('X-Men: Days of Future Past',),
 ('Spectre',),
 ('Batman v Superman: Dawn of Justice',),
 ('Captain America: Civil War',)]

### Simple filtering of text

The `WHERE` clause can also be used to filter text results, such as names or countries.

For example, this query gets the titles of all films which were filmed in China:

>SELECT title<br>
FROM films<br>
WHERE country = 'China';

In [28]:
%%sql
SELECT *
FROM movie
WHERE title = "Star Wars";

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624)]

### `WHERE` `AND`

Often, you'll want to select data based on multiple conditions. You can build up your `WHERE` queries by combining multiple conditions with the `AND` keyword.

For example,

>SELECT title<br>
FROM films<br>
WHERE release_year > 1994<br>
AND release_year < 2000;

gives you the titles of films released between 1994 and 2000.

In [32]:
%%sql
SELECT title
FROM movie
WHERE runtime > 200
AND runtime < 240;

 * mysql://hari31416:***@localhost:8080/movies
9 rows affected.

[('The Lord of the Rings: The Return of the King',),
 ('Once Upon a Time in America',),
 ('七人の侍',),
 ('Gone with the Wind',),
 ('Lawrence of Arabia',),
 ('Malcolm X',),
 ('Woodstock',),
 ("Heaven's Gate",),
 ('Gods and Generals',)]

Note that you need to specify the column name separately for every `AND` condition, so the following would be invalid:

>SELECT title<br>
FROM films<br>
WHERE release_year > 1994 AND < 2000;

In [34]:
%%sql
SELECT title
FROM movie
WHERE runtime > 200 AND < 240;

 * mysql://hari31416:***@localhost:8080/movies
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '< 240' at line 3")
[SQL: SELECT title
FROM movie
WHERE runtime > 200 AND < 240;]
(Background on this error at: https://sqlalche.me/e/14/f405)

### `WHERE` `AND` `OR`

In case you want to select rows based on multiple conditions where some but not all of the conditions need to be met you can use SQL's `OR` operator.

For example, the following returns all films released in either 1994 or 2000:

>SELECT title <br>
FROM films<br>
WHERE release_year = 1994<br>
OR release_year = 2000;

Note that just like `AND` you need to specify the column for every `OR` condition

When combining `AND` and `OR`, be sure to enclose the individual clauses in parentheses, like so:

>SELECT title <br>
FROM films<br>
WHERE (release_year = 1994 OR release_year = 1995)<br>
AND (certification = 'PG' OR certification = 'R');

Otherwise, due to SQL's precedence rules, you may not get the results you're expecting!

### `BETWEEN`

In SQL the `BETWEEN` keyword provides a useful shorthand for filtering values within a specified range.

>SELECT title<br>
FROM films<br>
WHERE release_year<br>
BETWEEN 1994 AND 2000;

The above query is the same as
>SELECT title<br>
FROM films<br>
WHERE release_year >= 1994<br>
AND release_year <= 2000;

In [35]:
%%sql
SELECT title
FROM movie
WHERE runtime
BETWEEN 200 AND 240;

 * mysql://hari31416:***@localhost:8080/movies
13 rows affected.

[('The Lord of the Rings: The Return of the King',),
 ('The Godfather: Part II',),
 ('Once Upon a Time in America',),
 ('七人の侍',),
 ('Gone with the Wind',),
 ('Lawrence of Arabia',),
 ('Malcolm X',),
 ('Woodstock',),
 ("Heaven's Gate",),
 ('Gods and Generals',),
 ('Chocolate: Deep Dark Secrets',),
 ('Emma',),
 ('The Secret',)]

**It's important to remember that BETWEEN is inclusive, meaning the beginning and end values are included in the results!**

Similar to the `WHERE` clause, the `BETWEEN` clause can be used with multiple `AND` and `OR` operators. For example, suppose we have a table called kids. We can get the names of all kids between the ages of 2 and 12 from the United States:

>SELECT name<br>
FROM kids<br>
WHERE age BETWEEN 2 AND 12<br>
AND nationality = 'USA';

### `IN BETWEEN`

The `IN` operator allows you to specify multiple values in a `WHERE` clause, making it easier and quicker to specify multiple `OR` conditions.

>SELECT name<br>
FROM kids<br>
WHERE age IN (2, 4, 6, 8, 10);

In [40]:
%%sql
SELECT title
FROM movie
WHERE runtime IN (180, 190, 200, 210, 220, 230, 240);

 * mysql://hari31416:***@localhost:8080/movies
7 rows affected.

[('The Godfather: Part II',),
 ('Bound by Honor',),
 ('Chocolate: Deep Dark Secrets',),
 ('The Wolf of Wall Street',),
 ('Restless',),
 ('Emma',),
 ('The Secret',)]

### Introduction to `NULL` and `IS NULL`

In SQL, `NULL` represents a missing or unknown value. You can check for `NULL` values using the expression `IS NULL`. For example, to count the number of missing birth dates in the `people` table:

>SELECT COUNT(*)<br>
FROM people<br>
WHERE birthdate IS NULL;

Sometimes, you'll want to filter out missing values so you only get results which are not NULL. To do this, you can use the `IS NOT NULL` operator.
>SELECT COUNT(*)<br>
FROM people<br>
WHERE birthdate IS NOT NULL;

In [62]:
%%sql
SELECT COUNT(*)
FROM movie
WHERE release_date IS NULL;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(0,)]

### `LIKE` and `NOT LIKE`

In `SQL`, the `LIKE` operator can be used in a `WHERE` clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with `LIKE`:

The `%` wildcard will match zero, one, or many characters in text. For example, the following query matches companies like `'Data'`, `'DataC'` `'DataCamp'`, `'DataMind'`, and so on:
>SELECT name<br>
FROM companies<br>
WHERE name LIKE 'Data%';

The `_` wildcard will match a single character. For example, the following query matches companies like `'DataCamp'`, `'DataComp'`, and so on:
>SELECT name <br>
FROM companies<br>
WHERE name LIKE 'DataC_mp';

You can also use the `NOT LIKE `operator to find records that don't match the pattern you specify.

In [46]:
%%sql
SELECT title
FROM movie
WHERE title LIKE 'Harry Potter%';

 * mysql://hari31416:***@localhost:8080/movies
6 rows affected.

[("Harry Potter and the Philosopher's Stone",),
 ('Harry Potter and the Chamber of Secrets',),
 ('Harry Potter and the Prisoner of Azkaban',),
 ('Harry Potter and the Goblet of Fire',),
 ('Harry Potter and the Order of the Phoenix',),
 ('Harry Potter and the Half-Blood Prince',)]

## Aggregate functions and Aliasing

Often, you will want to perform some calculation on the data in a database. `SQL` provides a few functions, called *aggregate functions*, to help you out with this.

For example,
>SELECT AVG(budget) <br>
FROM films;<br>

gives you the average value from the budget column of the films table. Similarly, the `MAX()` function returns the highest budget:

>SELECT MAX(budget) <br>
FROM films;

And more

In [47]:
%%sql
SELECT AVG(runtime)
FROM movie;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(Decimal('106.8314'),)]

In [53]:
%%sql
SELECT MAX(budget)
FROM movie;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(380000000,)]

### Combining aggregate functions with `WHERE`

Aggregate functions can be combined with the `WHERE` clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later:

>SELECT SUM(budget)<br>
FROM films<br>
WHERE release_year >= 2010;

In [54]:
%%sql
SELECT SUM(budget)
FROM movie
WHERE budget > 200000000;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(Decimal('6691000000'),)]

**A note on arithmetic**

>A note on arithmetic
In addition to using aggregate functions, you can perform basic arithmetic with symbols like +, -, *, and /. So, for example, this gives a result of 12: <br>SELECT (4 * 3);<br>
However, the following gives a result of 1:<br>SELECT (4 / 3);<br> SQL assumes that if you divide an integer by an integer, you want to get an integer back. So be careful when dividing!<br>If you want more precision when dividing, you can add decimal places to your numbers. For example,<br>SELECT (4.0 / 3.0)<br> AS result;
gives you the result you would expect: 1.333.

### AS aliasing

Suppose you want to get something like this:
>SELECT MAX(budget), MAX(duration)<br>
FROM films;

Well, then you'd have two columns named max, which isn't very useful!
To avoid situations like this, `SQL` allows you to do something called aliasing. Aliasing simply means you assign a temporary name to something. To alias, you use the `AS` keyword.
>SELECT MAX(budget) AS max_budget,<br>
       MAX(duration) AS max_duration<br>
FROM films;

In [55]:
%%sql
SELECT MAX(budget) AS max_budget,
       MAX(runtime) AS max_runtime
FROM movie;

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(380000000, 338)]

## `ORDER BY` and `GROUP BY`

In `SQL`, the `ORDER BY` keyword is used to sort results in ascending or descending order according to the values of one or more columns.<br>
By default `ORDER BY` will sort in ascending order. If you want to sort the results in descending order, you can use the `DESC` keyword. For example,

>SELECT title<br>
FROM films<br>
ORDER BY release_year DESC;

gives you the titles of films sorted by release year, from newest to oldest.

In [61]:
%%sql
SELECT title, release_date
FROM movie
ORDER BY release_date ASC
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[('America Is Still the Place', None),
 ('Intolerance', datetime.date(1916, 9, 4)),
 ('The Big Parade', datetime.date(1925, 11, 5)),
 ('Metropolis', datetime.date(1927, 1, 10)),
 ('Die Büchse der Pandora', datetime.date(1929, 1, 30)),
 ('The Broadway Melody', datetime.date(1929, 2, 8)),
 ("Hell's Angels", datetime.date(1930, 11, 15)),
 ('A Farewell to Arms', datetime.date(1932, 12, 8)),
 ('42nd Street', datetime.date(1933, 2, 2)),
 ('She Done Him Wrong', datetime.date(1933, 2, 9))]

### Sorting multiple columns

`ORDER BY` can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. For example,

>SELECT birthdate, name <br>
FROM people<br>
ORDER BY birthdate, name;<br>

sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important!

In [66]:
%%sql
SELECT title, release_date
FROM movie
ORDER BY title, release_date
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[('#Horror', datetime.date(2015, 11, 20)),
 ('$upercapitalist', datetime.date(2012, 8, 10)),
 ('(500) Days of Summer', datetime.date(2009, 7, 17)),
 ("...E tu vivrai nel terrore! L'aldilà", datetime.date(1981, 4, 22)),
 ('10 Cloverfield Lane', datetime.date(2016, 3, 10)),
 ('10 Days in a Madhouse', datetime.date(2015, 11, 20)),
 ('10 Things I Hate About You', datetime.date(1999, 3, 30)),
 ('102 Dalmatians', datetime.date(2000, 10, 7)),
 ('10th & Wolf', datetime.date(2006, 2, 19)),
 ('11:14', datetime.date(2003, 5, 16))]

### `GROUP BY`

For example, you might want to count the number of male and female employees in your company. Here, what you want is to group all the males together and count them, and group all the females together and count them. In `SQL`, `GROUP BY` allows you to group a result by one or more columns, like so:

>SELECT sex, count(*)<br>
FROM employees<br>
GROUP BY sex;

Commonly, `GROUP BY` is used with aggregate functions like `COUNT()` or `MAX()`. Note that `GROUP BY` always goes after the `FROM` clause!

Note that you can combine `GROUP BY` with `ORDER BY` to group your results, calculate something about them, and then order your results. For example,

>SELECT sex, count(*)<br>
FROM employees<br>
GROUP BY sex<br>
ORDER BY count DESC;

Note also that `ORDER BY` always goes after `GROUP BY`.

In [72]:
%%sql
SELECT movie_status, COUNT(*) as count
FROM movie
GROUP BY movie_status
ORDER BY count;

 * mysql://hari31416:***@localhost:8080/movies
3 rows affected.

[('Post Production', 3), ('Rumored', 5), ('Released', 4795)]

### `HAVING`

In `SQL`, aggregate functions can't be used in `WHERE` clauses. For example, the following query is **invalid**:

>SELECT release_year<br>
FROM films<br>
GROUP BY release_year<br>
WHERE COUNT(title) > 10;

This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the `HAVING` clause comes in. For example,

>SELECT release_year<br>
FROM films<br>
GROUP BY release_year<br>
HAVING COUNT(title) > 10;

shows only those years in which more than 10 films were released.

In [78]:
%%sql
SELECT runtime, COUNT(*) as count
FROM movie
GROUP BY runtime
HAVING count > 120
ORDER BY runtime;

 * mysql://hari31416:***@localhost:8080/movies
5 rows affected.

[(90, 163), (95, 123), (97, 133), (98, 140), (100, 149)]